Процедура ДополнитьФорму(Форма) Экспорт   
	
	ИмяФормы = Форма.ИмяФормы; 
	
	Если ИмяФормы = "Документ.ЗаказПокупателя.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма);
		ДобавитьГруппуРеквизитовСкидкаНаФорму(Форма);
		ДобавитьПолеСогласованнаяСкидкаНаФормуПередСуммаДокумента(Форма);
		ДобавитьКомандуПересчитатьСтрокуНаФорму(Форма);
	ИначеЕсли ИмяФормы = "Документ.ПоступлениеТоваровУслуг.Форма.ФормаДокумента" Тогда 
		ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма);
	ИначеЕсли ИмяФормы = "Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента" Тогда   
		ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма);
	ИначеЕсли ИмяФормы = "Документ.ОплатаОтПокупателя.Форма.ФормаДокумента" Тогда 
		ВставитьПолеКонтактноеЛицоПередНаФормуПередСуммаДокумента(Форма);
	ИначеЕсли ИмяФормы = "Документ.ОплатаПоставщику.Форма.ФормаДокумента" Тогда  
		ВставитьПолеКонтактноеЛицоПередНаФормуПередСуммаДокумента(Форма);
	КонецЕсли;
	
КонецПроцедуры 
	
Процедура ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма)  
	
	ПолеВвода = Форма.Элементы.Добавить("КонтактноеЛицо", Тип("ПолеФормы"), Форма.Элементы.ГруппаШапкаПраво);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.КЛ_КонтактноеЛицо";
	
КонецПроцедуры

Процедура ВставитьПолеКонтактноеЛицоПередНаФормуПередСуммаДокумента(Форма)
	
	ПолеВвода = Форма.Элементы.Вставить("КонтактноеЛицо", Тип("ПолеФормы"), , Форма.Элементы.СуммаДокумента);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.КЛ_КонтактноеЛицо";
	
КонецПроцедуры

Процедура ДобавитьПолеСогласованнаяСкидкаНаФормуПередСуммаДокумента(Форма)
	
	ПолеВвода = Форма.Элементы.Добавить("СогласованнаяСкидка", Тип("ПолеФормы"), Форма.Элементы.ГруппаРеквизитовСкидка);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.КЛ_СогласованнаяCкидка";
	
КонецПроцедуры

Процедура ДобавитьКомандуПересчитатьСтрокуНаФорму(Форма)
	
	КомандаОбновить = Форма.Команды.Добавить("Обновить");  
	КомандаОбновить.Заголовок = "Обновить";
	КомандаОбновить.Действие = "КомандаОбновить";
	
	КнопкаКоманды = Форма.Элементы.Добавить("КомандаОбновить", Тип("КнопкаФормы"), Форма.Элементы.ГруппаРеквизитовСкидка);
    КнопкаКоманды.ИмяКоманды = "Обновить"; 
	КнопкаКоманды.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
	КнопкаКоманды.Картинка = БиблиотекаКартинок.Обновить;
	КнопкаКоманды.Отображение = ОтображениеКнопки.Картинка;
	
КонецПроцедуры

Процедура ДобавитьГруппуРеквизитовСкидкаНаФорму(Форма)
	
	ГруппаРеквизитовСкидка = Форма.Элементы.Добавить("ГруппаРеквизитовСкидка", Тип("ГруппаФормы"), Форма.Элементы.ГруппаШапкаЛево); 
	ГруппаРеквизитовСкидка.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаРеквизитовСкидка.Отображение = ОтображениеОбычнойГруппы.Нет;
	ГруппаРеквизитовСкидка.ОтображатьЗаголовок = Ложь; 
	ГруппаРеквизитовСкидка.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;	
	
КонецПроцедуры

